In [1]:
#Open Source library built on top of numpy
#used for cleaning and preparation

In [4]:
import pandas as pd
import numpy as np

In [7]:
#Series
labels=['a','b','c','d']
my_data=[10,20,30,40]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [8]:
#passing data into series
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
d    40
dtype: int64

In [9]:
pd.Series(d)#passing a dictionary

a    10
b    20
c    30
dtype: int64

In [11]:
#series can hld any datatype int,float,string
#we can also pass built in function
pd.Series(data=[sum,print,len])

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [13]:
#How to grab Information?
ser1=pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [18]:
#We can access using index labels 

ser1['USA']

np.int64(1)

In [20]:
ser2=pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [21]:
#if we add two series 
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [22]:
#in the above when we add these series it will try to do the operation based on index,if it cannot find the match it will give nan

                                                                    Dataframes

In [23]:
#Syntax 
pd.DataFrame(data=None,index=None,columns=None,dtype=None,copy=False)

Empty DataFrame
Columns: []
Index: []

In [30]:
df=pd.DataFrame(data=np.random.randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A -0.439568  0.822822  0.246248  0.546029
B  0.761487  0.157528 -1.520171  0.648728
C -0.270709  0.382448  1.668600  0.499507
D -0.556925 -0.890022 -0.080057 -0.317839
E -0.537349 -0.526787 -1.021011  0.766681

In [31]:
#How to grab values in DataFrame?

In [35]:
print(df['W']) #selecting columns
#the output will be in series 
print(type(df['W']))

A   -0.439568
B    0.761487
C   -0.270709
D   -0.556925
E   -0.537349
Name: W, dtype: float64
<class 'pandas.core.series.Series'>

In [37]:
#to select multiple columns

print(df[['W','Z']])

          W         Z
A -0.439568  0.546029
B  0.761487  0.648728
C -0.270709  0.499507
D -0.556925 -0.317839
E -0.537349  0.766681

In [46]:
#to create a new column

df['new']=df['W']+df['Z']
print(df)

          W         X         Y         Z       new
A -0.439568  0.822822  0.246248  0.546029  0.106461
B  0.761487  0.157528 -1.520171  0.648728  1.410215
C -0.270709  0.382448  1.668600  0.499507  0.228798
D -0.556925 -0.890022 -0.080057 -0.317839 -0.874764
E -0.537349 -0.526787 -1.021011  0.766681  0.229331

#if you want to delete or drop the cloumn
#syntax
df.drop('columnname',axis=0,level=None,inplace=False,errors='raise')
axis=0 by default 
If you wat to drop or delete the column you should specify axis=1 
If you want to drop or delete the row you should specify axis=0 which is default

In [47]:
df.drop('new',axis=1,inplace=True)
df
#if you dont mention inplace=True then it will show new column it will be not deleted from the column

          W         X         Y         Z
A -0.439568  0.822822  0.246248  0.546029
B  0.761487  0.157528 -1.520171  0.648728
C -0.270709  0.382448  1.668600  0.499507
D -0.556925 -0.890022 -0.080057 -0.317839
E -0.537349 -0.526787 -1.021011  0.766681

In [48]:
df.drop('E',axis=0,inplace=True)
df

          W         X         Y         Z
A -0.439568  0.822822  0.246248  0.546029
B  0.761487  0.157528 -1.520171  0.648728
C -0.270709  0.382448  1.668600  0.499507
D -0.556925 -0.890022 -0.080057 -0.317839

In [50]:
#selecting rows

print(df.loc['C']) #labels based selection [indexing]
print(df.iloc[2]) #numerical pased indexing [position based]

W   -0.270709
X    0.382448
Y    1.668600
Z    0.499507
Name: C, dtype: float64
W   -0.270709
X    0.382448
Y    1.668600
Z    0.499507
Name: C, dtype: float64

In [53]:
df.loc[['A','B']] #TO select multiple rows

          W         X         Y         Z
A -0.439568  0.822822  0.246248  0.546029
B  0.761487  0.157528 -1.520171  0.648728

In [55]:
#if you want 2 or more rows and two or more columns
df.loc[['A','B'],['W','Z']]

          W         Z
A -0.439568  0.546029
B  0.761487  0.648728

In [57]:
#Same as sicing we have in pandas
print(df.iloc[0:3,0:3]) #first 0:3 for rows and second 0:3 for columns
print(df.loc["A":"C","W":"Y"]) #It is inclusive & include both

          W         X         Y
A -0.439568  0.822822  0.246248
B  0.761487  0.157528 -1.520171
C -0.270709  0.382448  1.668600
          W         X         Y
A -0.439568  0.822822  0.246248
B  0.761487  0.157528 -1.520171
C -0.270709  0.382448  1.668600

                                                    Conditional Operators

In [58]:
df>0 #It will Print Boolean Values

       W      X      Y      Z
A  False   True   True   True
B   True   True  False   True
C  False   True   True   True
D  False  False  False  False

In [66]:
bool=df>0
df[bool]# we will get values & Nan in place of false

          W         X         Y         Z
A       NaN  0.822822  0.246248  0.546029
B  0.761487  0.157528       NaN  0.648728
C       NaN  0.382448  1.668600  0.499507
D       NaN       NaN       NaN       NaN

In [67]:
#If you want any column values above 0
df['W']>0

A    False
B     True
C    False
D    False
Name: W, dtype: bool

In [70]:
df[df['W']>0]

          W         X         Y         Z
B  0.761487  0.157528 -1.520171  0.648728

In [71]:
#to comvert particular column to different datatypes
df['W'].astype(int) #it will convert the values of W column into int

A    0
B    0
C    0
D    0
Name: W, dtype: int64

In [76]:
df['Z']<0 #numbers <0 in z

A    False
B    False
C    False
D     True
Name: Z, dtype: bool

In [78]:
df[df['Z']<0]['Z'] #particular column

D   -0.317839
Name: Z, dtype: float64

In [80]:
#To change the column name 
#df.columns=['New name','New Name'] or
#df.replace(columns={"oldname":"newname"},inplace=True)

In pandas and operator or operator does not wrk we should use & | operator 
and and or are designed for scalar values (single True or False values),When applied to pandas objects like Series or DataFrames, which contain multiple elements, they cause errors.

In [82]:
df

          W         X         Y         Z
A -0.439568  0.822822  0.246248  0.546029
B  0.761487  0.157528 -1.520171  0.648728
C -0.270709  0.382448  1.668600  0.499507
D -0.556925 -0.890022 -0.080057 -0.317839

In [87]:
df[(df['W']>0) & (df['Z']>0)]

          W         X         Y         Z
B  0.761487  0.157528 -1.520171  0.648728

In [88]:
df[(df['W']>0) | (df['Z']>0)]

          W         X         Y         Z
A -0.439568  0.822822  0.246248  0.546029
B  0.761487  0.157528 -1.520171  0.648728
C -0.270709  0.382448  1.668600  0.499507

                                                Reset Index
The reset_index() function in pandas is used to reset the index of a DataFrame. It reassigns a default integer index to the DataFrame while optionally retaining or discarding the original index.

In [89]:
df.reset_index(inplace=True)

In [90]:
df

  index         W         X         Y         Z
0     A -0.439568  0.822822  0.246248  0.546029
1     B  0.761487  0.157528 -1.520171  0.648728
2     C -0.270709  0.382448  1.668600  0.499507
3     D -0.556925 -0.890022 -0.080057 -0.317839

In [98]:
#Lets Create a new Column
new=['CA','NY','WY','OR']
df['States']=new
df

       index         W         X         Y         Z States
States
CA         A -0.439568  0.822822  0.246248  0.546029     CA
NY         B  0.761487  0.157528 -1.520171  0.648728     NY
WY         C -0.270709  0.382448  1.668600  0.499507     WY
OR         D -0.556925 -0.890022 -0.080057 -0.317839     OR

                                                            Set Index

In [99]:
df.set_index('States',inplace=True)

In [100]:
df

       index         W         X         Y         Z
States
CA         A -0.439568  0.822822  0.246248  0.546029
NY         B  0.761487  0.157528 -1.520171  0.648728
WY         C -0.270709  0.382448  1.668600  0.499507
OR         D -0.556925 -0.890022 -0.080057 -0.317839

Difference between reset_index() nd set_index() is that set_index will replace the existing index
If Column name is not there in the dataframe and you are trying to set that particular column as the index then set_index will not work we should use 
new=['CA','NY','WY','OR']
df.index=new

If you just want to change the name of the index then we should  use 
df.index.name='New index name'

                                                                Missing Data

In [101]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df=pd.DataFrame(d)
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

#dropna() function -it will drop columns or rows with nan values
#syntax
df.dropna(axis=0,how='any',thresh=None,subset=None,inplace=True)